performance-tests/get-board.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 60
      arrivalRate: 5
      name: Warm up
    - duration: 120
      arrivalRate: 5
      rampTo: 50
      name: Ramp up load
    - duration: 240
      arrivalRate: 50
      name: Sustained load

scenarios:
  - name: "Get board"
    flow:
      - get:
          url: "/squares"